УТ_для_edt/src/InformationRegisters/смартВходящиеСобытияВзаимодействий/смартВходящиеСобытияВзаимодействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартВходящиеСобытияВзаимодействий</name>
  <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КемОбработано</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>КогдаОбработано</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Партнер</name>
    <comment>#1789 смарт: Ермаков 22.04.2024 / Доработка механизма оповещений менеджеров.	</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидСобытия</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>EnumRef.смартВидыСобытийВзаимодействий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартИсторияСтатусовСотрудников/смартИсторияСтатусовСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартИсторияСтатусовСотрудников</name>
  <comment>//++ #1739 смарт: Фролов 05.04.2024 //Создание рабочего места секретаря для распределения звонков и обращений.</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РучнойВвод</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.смартСтатусыСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>До</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтсрочкиПоОтпуску</name>
    <comment>//++ #Б-2852 смарт: Фролов 11.04.2025 //Реализовать возможность присваивать Архивное &quot;Состояние СЦ&quot; Менеджерами СЦ</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартВидыСобытийВзаимодействий/смартВидыСобытийВзаимодействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыСобытийВзаимодействий</name>
  <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
  <enumValues>
    <name>ВходящийТелефонныйЗвонок</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
  </enumValues>
  <enumValues>
    <name>СозданиеДокументаИнтерес</name>
    <comment>#1760 смарт: Ермаков 12.04.2024 / Создание механизма оповещений менеджеров о назначенных Интересах.</comment>
  </enumValues>
  <enumValues>
    <name>НайденСуществующийПартнер</name>
    <comment>#1789 смарт: Ермаков 22.04.2024 / Доработка механизма оповещений менеджеров.	</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартЛид/смартЛид.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартЛид</name>
  <comment>//++ #1543 смарт: Фролов 08.11.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <comment>Клиент</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПолученияЛида</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЛида</name>
    <type>
      <types>EnumRef.смартСостоянияЛидов</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтклоненияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстИсточника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатыПоискаПоКИ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <comment>Тема</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегионТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.смартКвалификацииМенеджеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заметка</name>
    <type>
      <types>CatalogRef.Заметки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаСменыОтветственного</name>
    <type>
      <types>CatalogRef.смартПричиныСменыОтветственных</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийОтветственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Распределил</name>
    <comment>//++ #1835 смарт: Фролов 28.05.2024 //Доработка рабочего места секретаря</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Yclid_Метка</name>
    <comment>//++ #1941 смарт: Фролов 22.07.2024 //Добавить реквизит &quot;yclid&quot; к Лиду и Заявкам</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ClientID</name>
    <comment>#1958 смарт: Лопато 05.08.2024 //Добавить реквизит &quot;ClientID&quot; к Лиду и Заявкам</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>JSON_ИМ_Регистрация</name>
    <comment>//++ #Б-986 смарт: Фролов 23.09.2024 //ИМ. Регистрация пользователя на сайте</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>700</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Roistat_visit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>source</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленоОповещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

УТ_для_edt/src/Catalogs/ГруппыПользователей/ГруппыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователей</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВсеПользователи</name>
      <description>Все пользователи</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартБизнесРегионы</name>
    <comment>//++ #1543 смарт: Фролов 22.11.2023 //Автоматическое распределение лидов на менеджеров</comment>
    <attributes>
      <name>БизнесРегион</name>
      <type>
        <types>CatalogRef.БизнесРегионы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/смартСобытияВзаимодействий/Module.bsl
////////////////////////////////////////////////////////////
// Модуль смартСобытияВзаимодействий предназначен для 
// хранения процедур и функций, связанных с событиями взаимодействий.
// Примеры:
//  - интерактивная работа с пользователем
//	- взаимосвязь внешних событий и пользователей
//	- и подобное
// 
// Модуль создал - Ермаков, 12.04.2024
////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
	
// Выполняет регистрацию событий взаимодействий (получение данных от АТС и подобное).
//
// Параметры:
// 		ВидСобытия - ПеречисленияСсылка.смартВидыСобытийВзаимодействий
// 		Источник - произвольное название источника
// 		Данне - произвольные вспомогательные данные, передаваемые источником
//
Процедура ЗарегистрироватьСобытиеВзаимодействия(ВидСобытия, Источник, Данные = Неопределено) Экспорт
	
	//++ #1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С
	Если ВидСобытия = Перечисления.смартВидыСобытийВзаимодействий.ВходящийТелефонныйЗвонок Тогда 
		
		// Регистрируем входящий телефонный звонок по запросу от АТС (см. HTTP-Сервис AsteriskExchange)
		// Регистрация производится для всех пользователей, которые являются секретарями
		////////////////////////

		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Данные);
		
		МассивПроверяеиыхСвойств = Новый Массив;
		МассивПроверяеиыхСвойств.Добавить("КтоВзялТрубку");
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("смартСобытияВзаимодействий");
		
		СтруктураДанных = ПрочитатьJSON(ЧтениеJSON,,,, "ВосстановитьДанныеJSON", Модуль, ВидСобытия, МассивПроверяеиыхСвойств);	
		
		Если ЗначениеЗаполнено(СтруктураДанных.КтоВзялТрубку) Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);
			Запрос.УстановитьПараметр("uid", "%" + СтруктураДанных.uid + "%"); 
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Период, ИдентификаторСобытия
			|ИЗ
			|	РегистрСведений.смартВходящиеСобытияВзаимодействий
			|ГДЕ
			|	ВидСобытия = &ВидСобытия
			|	И Данные ПОДОБНО &uid";
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				ИдентификаторСобытия = Выборка.ИдентификаторСобытия;
				ПериодСобытия = Выборка.Период;
							
				НабораЗаписей = РегистрыСведений.смартВходящиеСобытияВзаимодействий.СоздатьНаборЗаписей();
				НабораЗаписей.Отбор.ИдентификаторСобытия.Установить(ИдентификаторСобытия);
				НабораЗаписей.Прочитать();
				
				Для Каждого ЗаписьНабора Из НабораЗаписей Цикл
					ЗаписьНабора.Данные = Данные;		
				КонецЦикла;                             
				
				НабораЗаписей.Записать();
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ГруппаПользователейСекретариат = Справочники.ГруппыПользователей.НайтиПоНаименованию("Секретариат", Истина);
	     
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Группа", ГруппаПользователейСекретариат);
		Запрос.Текст =                   
		"ВЫБРАТЬ
		|	Пользователь
		|ПОМЕСТИТЬ Пользователи
		|ИЗ
		|	Справочник.ГруппыПользователей.Состав
		|ГДЕ
		|	Ссылка = &Группа
		|;
		|ВЫБРАТЬ
		|	Пользователь
		|ИЗ
		|	РегистрСведений.смартИсторияСтатусовСотрудников.СрезПоследних(
		|		,
		|		Пользователь В (ВЫБРАТЬ Пользователь ИЗ Пользователи)
		|			И Статус = ЗНАЧЕНИЕ(Справочник.смартСтатусыСотрудников.НаРабочемМесте)
		|	) КАК История
		|";
		Выборка = Запрос.Выполнить().Выбрать();
		
		ИдентификаторСобытия = Строка(Новый УникальныйИдентификатор);
		ПериодСобытия = ТекущаяДата();
		
		Пока Выборка.Следующий() Цикл
		
			МенеджерЗаписи = РегистрыСведений.смартВходящиеСобытияВзаимодействий.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ПериодСобытия;
			МенеджерЗаписи.ИдентификаторСобытия = ИдентификаторСобытия; 
			МенеджерЗаписи.Пользователь = Выборка.Пользователь;
			МенеджерЗаписи.ВидСобытия = ВидСобытия;
			
			Если Не Данные = Неопределено Тогда
				МенеджерЗаписи.Данные = Данные;
			КонецЕсли;
			
			МенеджерЗаписи.Записать();
			
		КонецЦикла;
		
	КонецЕсли;
	//-- #1747 смарт: Ермаков 05.04.2024
	
	// Регистрируем документ Интерес (переменная Данные).
	// Регистрация производится для пользователя, указанного в документе.
	////////////////////////
	
	//++ #1760 смарт: Ермаков 05.04.2024 / Создание механизма оповещений менеджеров о назначенных Интересах.
	Если ВидСобытия = Перечисления.смартВидыСобытийВзаимодействий.СозданиеДокументаИнтерес Тогда
		
		Пользователь = Данные.Ответственный;
				
		Если Не смартПользователи.ИспользуетПодсистемуCRM(Пользователь) Тогда
			Возврат;
		КонецЕсли;
		
		//++ #Б-3550 смарт: Фролов 16.06.2025 //Оптимизация прохождения по этапам воронки для документов ЗПР
		//Для этих двух документов не нужно оповещение
		Если НЕ (ЗначениеЗаполнено(Данные.ДокументОснование)
			И ТипЗнч(Данные.ДокументОснование) <> Тип("ДокументСсылка.смартЗаявкаНаПускоНаладку")
			И ТипЗнч(Данные.ДокументОснование) <> Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы")) Тогда
			
			Возврат;
			
		КонецЕсли;
		//-- #Б-3550 смарт: Фролов 16.06.2025
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Данные", Данные);
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные
		|ИЗ
		|	РегистрСведений.смартВходящиеСобытияВзаимодействий.СрезПоследних(
		|		,
		|		Пользователь = &Пользователь
		|			И ВидСобытия = &ВидСобытия
		|			И Данные = &Данные
		|			И НЕ Обработано
		|	)
		|";

		Если Запрос.Выполнить().Пустой() Тогда
			
			МенеджерЗаписи = РегистрыСведений.смартВходящиеСобытияВзаимодействий.СоздатьМенеджерЗаписи();

			МенеджерЗаписи.Период = ТекущаяДата();			
			МенеджерЗаписи.ИдентификаторСобытия = Строка(Новый УникальныйИдентификатор()); 
			МенеджерЗаписи.Пользователь = Пользователь;
			МенеджерЗаписи.ВидСобытия = ВидСобытия;
			МенеджерЗаписи.Данные = Данные;
			
			МенеджерЗаписи.Записать();
			
		 КонецЕсли;
		
	КонецЕсли;
	//++ #1760 смарт: Ермаков 05.04.2024
	
	//++ #1789 смарт: Ермаков 22.04.2024 / Доработка механизма оповещений менеджеров.
	Если ВидСобытия = Перечисления.смартВидыСобытийВзаимодействий.НайденСуществующийПартнер Тогда
		
		Если Не ТипЗнч(Данные) = Тип("Структура") Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Данные.Пользователь) 
			Или Не ЗначениеЗаполнено(Данные.Партнер) Тогда
			Возврат;
		КонецЕсли;
		
		МассивПроверяеиыхСвойств = Новый Массив;
		МассивПроверяеиыхСвойств.Добавить("Пользователь");
		МассивПроверяеиыхСвойств.Добавить("Партнер");
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("смартСобытияВзаимодействий");		
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Данные,, "ПреобразоватьДанныеJSON", Модуль, ВидСобытия);
		ТекстJSON = ЗаписьJSON.Закрыть();
		
		МенеджерЗаписи = РегистрыСведений.смартВходящиеСобытияВзаимодействий.СоздатьМенеджерЗаписи();

		МенеджерЗаписи.Период = ТекущаяДата();			
		МенеджерЗаписи.ИдентификаторСобытия = Строка(Новый УникальныйИдентификатор()); 
		МенеджерЗаписи.Пользователь = Данные.Пользователь;
		МенеджерЗаписи.ВидСобытия = ВидСобытия;
		МенеджерЗаписи.Данные = ТекстJSON;
		МенеджерЗаписи.Партнер = Данные.Партнер;
		
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	//-- #1789 смарт: Ермаков 22.04.2024
	
КонецПроцедуры 

// Определяет, были ли ранее зарегистрированные события(получение данных от АТС и подобное).
// Устанавлиает полученные значения в переменную Данные
//
// Параметры:
// 		ВидСобытия - ПеречисленияСсылка.смартВидыСобытийВзаимодействий
//		Данные - Произвольное значение
// Возвращаемое значение:
// 		Булево - Истина, если данные выбраны
//
Функция ПолучитьДанныеСобытияВзаимодействий(ВидСобытия, Данные) Экспорт
	
	//++ #1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С
	МассивСтруктур = Новый Массив;
	Пользователь = Пользователи.АвторизованныйПользователь();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	Период, ИдентификаторСобытия, Данные, 
	|	НЕ &Пользователь = КемОбработано
	|		И НЕ КемОбработано = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК Удалить
	|ИЗ
	|	РегистрСведений.смартВходящиеСобытияВзаимодействий
	|ГДЕ
	|	Пользователь = &Пользователь
	|	И ВидСобытия = &ВидСобытия
	|	И НЕ Обработано
	|	И НЕ Данные = Неопределено
	|   //Условия
	|//Упорядочивание";
	
	Если ВидСобытия = Перечисления.смартВидыСобытийВзаимодействий.СозданиеДокументаИнтерес
		Или ВидСобытия = Перечисления.смартВидыСобытийВзаимодействий.НайденСуществующийПартнер 
		Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//Упорядочивание", "УПОРЯДОЧИТЬ ПО Период УБЫВ"); 	
		
	КонецЕсли; 
	
	Если ВидСобытия = Перечисления.смартВидыСобытийВзаимодействий.НайденСуществующийПартнер Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Данные,", "Партнер,"); 		
	КонецЕсли;
	

	Выборка = Запрос.Выполнить().Выбрать();	
	
	Если Не Выборка.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ВидСобытия = Перечисления.смартВидыСобытийВзаимодействий.ВходящийТелефонныйЗвонок Тогда
				
		Пока Выборка.Следующий() Цикл
						
	 		ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Выборка.Данные); 
			
			Попытка
				
				МассивПроверяеиыхСвойств = Новый Массив;
				МассивПроверяеиыхСвойств.Добавить("КтоВзялТрубку");
				
				Модуль = ОбщегоНазначения.ОбщийМодуль("смартСобытияВзаимодействий");
				
				СтруктураДанных = 
					ПрочитатьJSON(ЧтениеJSON,,,, "ВосстановитьДанныеJSON", Модуль, ВидСобытия, МассивПроверяеиыхСвойств);	
				
				МассивСтруктур.Добавить(
					Новый Структура("Период, ИдентификаторСобытия, Данные, Удалить",
							Выборка.Период,
							Выборка.ИдентификаторСобытия,
							СтруктураДанных,
							Выборка.Удалить)
					);

			Исключение
			КонецПопытки;
			
		КонецЦикла;

	КонецЕсли; 
	//-- #1747 смарт: Ермаков 05.04.2024
	
	//++ #1760 смарт: Ермаков 05.04.2024 / Создание механизма оповещений менеджеров о назначенных Интересах.
	Если ВидСобытия = Перечисления.смартВидыСобытийВзаимодействий.СозданиеДокументаИнтерес Тогда
		
		// Возвращаем информацию о последней записи с документом Интерес
		// Дополнительно, информируем о количестве неразобранных документов
		//////////////
		
		Выборка.Следующий();
		
		// Подготовка структуры возврата
		Запрос.УстановитьПараметр("Ссылка", Выборка.Данные);
		Запрос.УстановитьПараметр("КоличествоДокументов", Выборка.Количество() - 1);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Ссылка 									КАК Документ,
		|	Документ.Партнер 							КАК Партнер,
		|	Основание.КонтактноеЛицо 					КАК КонтактноеЛицо,
		|	Основание.ТекстИсточника 					КАК Потребность,
		|	Основание.БизнесРегионТекст 				КАК Регион,
		|	Документ.смартПредварительнаяКвалификация	КАК Квалификация,
		|	Документ.смартИнтересКанал					КАК Канал,
		|	&КоличествоДокументов						КАК КоличествоДокументов 
		|ИЗ
		|	Документ.CRM_Интерес КАК Документ
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.смартЛид КАК Основание
		|	ПО
		|		Основание.Ссылка = Документ.ДокументОснование
		|
		|ГДЕ
		|	Документ.Ссылка = &Ссылка
		|";
		ТаблицаДанных = Запрос.Выполнить().Выгрузить();
		
		СтруктураДанных = Новый Структура;
		
		Для Каждого Колонка Из ТаблицаДанных.Колонки Цикл
			СтруктураДанных.Вставить(Колонка.Имя);	
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ТаблицаДанных[0]); 	
		
		МассивСтруктур.Добавить(
			Новый Структура("Период, ИдентификаторСобытия, Данные",
					Выборка.Период,
					Выборка.ИдентификаторСобытия,
					СтруктураДанных)
			);
		
	КонецЕсли;
	//-- #1760 смарт: Ермаков 05.04.2024
	
	//++ #1789 смарт: Ермаков 22.04.2024 / Доработка механизма оповещений менеджеров.
	Если ВидСобытия = Перечисления.смартВидыСобытийВзаимодействий.НайденСуществующийПартнер Тогда
		
		Выборка.Следующий();
		
		МассивСтруктур.Добавить(
			Новый Структура("Период, ИдентификаторСобытия, Данные",
					Выборка.Период,
					Выборка.ИдентификаторСобытия,
					Новый Структура("Партнер", Выборка.Партнер))
			);
				
	КонецЕсли;
	//-- #1789 смарт: Ермаков 22.04.2024	
	
	//++ #1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С
	Данные = Новый Структура("ВидСобытия, Пользователь, НаборДанных", ВидСобытия, Пользователь, МассивСтруктур);
	Возврат Истина;
	//-- #1747 смарт: Ермаков 05.04.2024
	
КонецФункции

// Устанавливает признак обработки события для всех записей с переданным идентификатором.
//
// Параметры:
// 		ИдентификаторСобытия - Строка, идентификатор события
// Возвращаемое значение:
// 		Булево - Истина в случае успеха
//
Функция ОбработатьДанныеСобытияВзаимодействий(ИдентификаторСобытия) Экспорт
	
	//++ #1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С
	УстановитьПривилегированныйРежим(Истина);        
		
	Пользователь = Пользователи.АвторизованныйПользователь();
	ТекущаяДата = ТекущаяДата();
	
	// Первичные данные по идентификатору
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 * ИЗ РегистрСведений.смартВходящиеСобытияВзаимодействий ГДЕ ИдентификаторСобытия = &ИдентификаторСобытия");
	Запрос.УстановитьПараметр("ИдентификаторСобытия", ИдентификаторСобытия);
	МенеджерЗаписи = Запрос.Выполнить().Выбрать();
	
	Если Не МенеджерЗаписи.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если МенеджерЗаписи.ВидСобытия = Перечисления.смартВидыСобытийВзаимодействий.ВходящийТелефонныйЗвонок Тогда
		
		// Отмечаем обработку записей для всех пользователей, в рамках одного идентификатора
		// Если запись была обработана кем-либо, то другому пользователю это уже не потребуется
		/////////////
		
		НаборЗаписей = РегистрыСведений.смартВходящиеСобытияВзаимодействий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторСобытия.Установить(ИдентификаторСобытия);
		НаборЗаписей.Прочитать();
		
		Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
			
			Если Не ЗаписьНабора.Обработано Тогда
				
				Если ЗаписьНабора.КемОбработано.Пустая() Тогда
					
					ЗаписьНабора.КемОбработано = Пользователь;
					ЗаписьНабора.КогдаОбработано = ТекущаяДата;	
					
				КонецЕсли;
				
				ЗаписьНабора.Обработано = (Пользователь = ЗаписьНабора.Пользователь); 

			КонецЕсли;
			
		КонецЦикла;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			Возврат Ложь;
		КонецПопытки; 
	//-- #1747 смарт: Ермаков 05.04.2024
	
	//++ #1760 смарт: Ермаков 05.04.2024 / Создание механизма оповещений менеджеров о назначенных Интересах.
	ИначеЕсли МенеджерЗаписи.ВидСобытия = Перечисления.смартВидыСобытийВзаимодействий.СозданиеДокументаИнтерес Тогда
		
		// Помимо обработки конкретной записи, необходимо отметить как Обработано следующее:
		//  - записи, у которых указан тот же документ (Данные)
		//  - всезаписи с документами, дата которых ранее даты текущей записи
		//
		// Считается, что если Интерес пользователю выдан, то документы созданные до него. уже не актуальны.
		///////////////
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Данные", МенеджерЗаписи.Данные);
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		Запрос.УстановитьПараметр("ВидСобытия", МенеджерЗаписи.ВидСобытия);
		Запрос.УстановитьПараметр("МаксимальныйПериод", МенеджерЗаписи.Период);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИдентификаторСобытия
		|ИЗ
		|	РегистрСведений.смартВходящиеСобытияВзаимодействий
		|ГДЕ
		|	(
		|		Данные = &Данные
		|		ИЛИ
		|		(
		|			Пользователь = &Пользователь
		|			И ВидСобытия = &ВидСобытия
		|			И Период < &МаксимальныйПериод
		|		)
		|	)
		|	И НЕ Обработано
		|";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.смартВходящиеСобытияВзаимодействий.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИдентификаторСобытия.Установить(Выборка.ИдентификаторСобытия);
			НаборЗаписей.Прочитать();
			
			Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
				
				ЗаписьНабора.Обработано = Истина; 
				ЗаписьНабора.КемОбработано = Пользователь;
				ЗаписьНабора.КогдаОбработано = ТекущаяДата; 				
				
			КонецЦикла;
			
			НаборЗаписей.Записать();
			
		КонецЦикла;
	//++ #1760 смарт: Ермаков 05.04.2024	
	
	//++ #1789 смарт: Ермаков 22.04.2024 / Доработка механизма оповещений менеджеров.
	ИначеЕсли МенеджерЗаписи.ВидСобытия = Перечисления.смартВидыСобытийВзаимодействий.НайденСуществующийПартнер Тогда
		
		НаборЗаписей = РегистрыСведений.смартВходящиеСобытияВзаимодействий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторСобытия.Установить(ИдентификаторСобытия);
		НаборЗаписей.Прочитать();
		
		Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
			
			ЗаписьНабора.Обработано = Истина; 
			ЗаписьНабора.КемОбработано = Пользователь;
			ЗаписьНабора.КогдаОбработано = ТекущаяДата; 				
			
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	//-- #1789 смарт: Ермаков 22.04.2024
	
	//++ #1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С
	Возврат Истина;	
	//-- #1747 смарт: Ермаков 05.04.2024
	
КонецФункции

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

// Форматирует данные JSON в процессе его чтения
// Параметры
//  - см. описание ПрочитатьJSON, ФункцияВосстановления
Функция ВосстановитьДанныеJSON(Свойство, Значение, ДополнительныеПараметры) Экспорт
	
	//++ #1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С
	Если ДополнительныеПараметры = Перечисления.смартВидыСобытийВзаимодействий.ВходящийТелефонныйЗвонок Тогда
		
		// Преобразуем значение "SIP/206-0000054e" в "206"
		Если Свойство = "КтоВзялТрубку" Тогда 
			
			Если ЗначениеЗаполнено(Значение) Тогда
				
				Значение = Сред(Значение, СтрНайти(Значение, "/") + 1);
				Значение = Лев(Значение, СтрНайти(Значение, "-") - 1);
				Возврат Значение;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #1747 смарт: Ермаков 05.04.2024
	
КонецФункции

// Форматирует данные JSON в процессе его записи
// Параметры
//  - см. описание ЗаписатьJSON, ФункцияПреобразования
Функция ПреобразоватьДанныеJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	//++ #1789 смарт: Ермаков 22.04.2024 / Доработка механизма оповещений менеджеров.
	Если ДополнительныеПараметры = Перечисления.смартВидыСобытийВзаимодействий.НайденСуществующийПартнер Тогда
		
		Возврат Строка(Значение.УникальныйИдентификатор());
		
	КонецЕсли;
	//-- #1789 смарт: Ермаков 22.04.2024
	
КонецФункции

#КонецОбласти
